---
kind: enumMember
id: F:Autodesk.Revit.DB.ImageTypeSource.Internal
enum: Autodesk.Revit.DB.ImageTypeSource
source: html/b175940c-15a0-7bda-6f76-408f37e41ffe.htm
---
# Autodesk.Revit.DB.ImageTypeSource.Internal

The image data was created internally.
 These are rendering images or views saved in the project as images.